## S03-L009-LAB Ranking

In [1]:
import pandas as pd
import numpy as np

fortune = pd.read_csv('course-files/Fortune_500_2017.csv', index_col='Rank', low_memory=False,\
                   usecols=['Rank','Title','Employees','Profits','Assets'])

In [2]:
fortune.head()

                   Title  Employees  Profits  Assets
Rank
1                Walmart    2300000  13643.0  198825
2     Berkshire Hathaway     367700  24074.0  620854
3                  Apple     116000  45687.0  321686
4            Exxon Mobil      72700   7840.0  330314
5               McKesson      68000   2258.0   56563

In [5]:
fortune['Employees'].rank(ascending=False).head()

Rank
1      1.0
2      7.0
3     57.0
4     94.0
5    104.5
Name: Employees, dtype: float64

In [18]:
fortune['RankByEmployee'] = fortune['Employees'].rank(ascending=False)

In [23]:
fortune['RankByProfits'] = fortune['Profits'].rank(ascending=False)

In [24]:
fortune.nlargest(3,'Assets')

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
20,Fannie Mae,7000,12313.0,3287968,446.5,15.0
21,J.P. Morgan Chase,243355,24733.0,2490972,20.0,2.0
26,Bank of America Corp.,208024,17906.0,2187702,29.0,6.0

In [25]:
fortune.nsmallest(3,'Assets')

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
395,A-Mark Precious Metals,83,9.3,437,500.0,434.0
247,Core-Mark Holding,7688,54.2,1497,434.0,430.0
495,Big Lots,23150,152.8,1608,266.0,403.0

In [28]:
fortune.nlargest(20,['RankByEmployee', 'RankByProfits'])

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
395,A-Mark Precious Metals,83,9.3,437,500.0,434.0
472,Host Hotels & Resorts,220,762.0,11408,499.0,232.0
480,Delek US Holdings,1326,-153.7,2985,498.0,449.0
189,INTL FCStone,1464,54.7,5951,497.0,429.0
334,Global Partners,1770,-199.4,2564,496.0,455.0
402,Targa Resources,1970,-187.3,12871,495.0,451.0
483,Western & Southern Financial Group,2178,241.2,43831,494.0,374.0
246,Reinsurance Group of America,2371,701.4,53098,493.0,246.0
400,Calpine,2372,92.0,19317,492.0,422.0
312,Oneok,2384,352.0,16139,491.0,338.0
356,EOG Resources,2650,-1096.7,29459,490.0,484.0
274,HollyFrontier,2676,-260.5,9436,489.0,459.0
415,CalAtlantic Group,3055,484.7,8709,488.0,305.0
172,PBF Energy,3165,170.8,7622,487.0,397.0
237,NGL Energy Partners,3200,-198.9,5560,486.0,454.0
316,Thrivent Financial for Lutherans,3282,587.8,88561,485.0,275.0
343,Chesapeake Energy,3300,-4401.0,13028,484.0,498.0
329,Genworth Financial,3400,-277.0,104658,483.0,461.0
428,Alleghany,3420,456.9,23757,482.0,310.0
231,Devon Energy,3545,-3302.0,25913,481.0,495.0

In [29]:
fortune.head()

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
3,Apple,116000,45687.0,321686,57.0,1.0
4,Exxon Mobil,72700,7840.0,330314,94.0,27.0
5,McKesson,68000,2258.0,56563,104.5,102.0